In [2]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [13]:
df = pd.DataFrame([['c', 3, 'cat'], ['c', 3, 'cat'], ['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])

In [14]:
df

  letter  number animal
0      c       3    cat
1      c       3    cat
2      c       3    cat
3      d       4    dog

In [20]:
df.iloc[0:2]

  letter  number animal
0      c       3    cat
1      c       3    cat

In [22]:
df0 = pd.DataFrame(df.iloc[0:2])

In [25]:
df1 = pd.DataFrame(df.iloc[2:])

In [23]:
df0

  letter  number animal
0      c       3    cat
1      c       3    cat

In [26]:
df1

  letter  number animal
2      c       3    cat
3      d       4    dog

In [28]:
df_c = pd.concat([df1, df0]).sort_index()
df_c

  letter  number animal
0      c       3    cat
1      c       3    cat
2      c       3    cat
3      d       4    dog